{"pages":[{"title":"About","text":"","link":"/about/index.html"},{"title":"Richard Butler","text":"EducationFlorida Atlantic UniversityBachelors of Science Computer Science2004-2010 ExperienceOffice Depot, incSenior Systems EngineerNovember 2013 - June 2016As a Senior Systems Engineer for End User Computing at Office Depot, I worked with SCCM to manage over 6,000 computers. This included coding and re-packaging various software packages through SCCM using WiseScript, VBScript, and C#. I also automated the OSX imaging process with Bash and AppleScript, and wrote a utility to synchronize Apple Remote Desktop databases in Clojure. TrialGraphix, Inc. (LegalRadius)Software Engineer2011 - November 2013Involved in several projects to modernize, expand functionality, and update the LegalRadius code base. This included writing a new module for document review, recreating the functionality of the transcript management tool, and designing a service to sync text and speech transcripts for playback in the transcript management tool. The document review tool was created to manage legal exhibits and the post discovery process of annotating and searching large collections of documents for pertinent case information. In building the document review tool Apache SOLR was used to manage searchable records of the documents created from data extracted from PDF files as well as images run through Tesseract OCR, in additions Mozilla PDF.js was used to standardize the viewing process across all modern browsers. Rewriting transcript management tool in HTML5 from Flash included extensive use of Javascript including JQUERY, Backbone.js, and Marionette.js to manage the numerous different page views and interactions with the documents. Both of these projects were built using Visual Studio and C#, with page rendering utilizing ASP.NET MVC and ASP.NET Web API (HTTP API) connected to Microsoft SQL servers. Database interactions included LINQ to Entities, stored procedures written in Transact-SQL, and SQL Queries passed to the database. The front end development utilized Node.js including NPM and Bower for building, testing, and managing code dependencies. The Transcript Alignment was tool developed in Eclipse with Java 1.7 utilizing Maven to manage dependencies and YAJSW to create a service that ran on windows to synchronize transcripts with timestamps to the associated audio files in order to playback text and audio line by line in the transcript management module. Skills used: Apache SOLR, ASP.NET, ASP.NET MVC, ASP.NET WEB API, Bower, C#, Eclipse IDE, Java, Javascript (Backbone.js, JQuery, Marionette.js, Require.js), Maven, Node.js, NPM, Microsoft SQL Server, Tesseract OCR, Transact-SQL, Visual Studio, YAJSW. SDI, Inc. at Office Depot, Inc.Enterprise Archiving Engineer2010As part of a project to process PST files into a searchable archive, I created several Powershell powerpacks with PowerGUI to manage and automate the entire process. Office Depot, Inc..Intern Citrix Systems Engineer2010As part of a project to process PST files into a searchable archive, I created several Powershell powerpacks with PowerGUI to manage and automate the entire process.","link":"/resume/index.html"}],"posts":[{"title":"hello","text":"","link":"/2019/02/20/hello/"}],"tags":[],"categories":[]}